'use strict';

// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
function rectangleArea(a, b) {
    return a * b;
}

console.log(rectangleArea(20, 20));



// - створити функцію яка обчислює та повертає площу кола з радіусом r
function circleArea(r) {
   return Math.PI * Math.pow(r, 2);
}

console.log(circleArea(4));



// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
function cylinderArea(r1, h) {
    return 2 * Math.PI * r1 * (r1 + h);
}

console.log(cylinderArea(4, 4));



// - створити функцію яка приймає масив та виводить кожен його елемент
function array (arr) {
    for (let arrElement of arr) {
        console.log(arrElement);
    }
}

array([1, 2, 3, 4, 5]);



// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
function paragraph(tag, text) {
    document.write(`<${tag}>${text}<${tag}>`);
}

paragraph('p', 'Lorem ipsum.');


// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13